import { ElMessageBox} from 'element-plus';
import { STORE_Editor } from '/store/modules/editor';

tinymce.PluginManager.add('clear', function (editor, url) {
  var pluginName = '清屏';
  var clearText = function () {
    ElMessageBox.confirm('确认清除所有内容', '警告', {
      confirmButtonText: '确认',
      cancelButtonText: '取消',
      type: 'warning',
      showClose: false,
    })
      .then(() => {
        //判断是否缩进
        let orgin_text = editor.getContent();

        editor.resetContent();
        if (orgin_text.includes('text-indent')) {
          editor.execCommand('indent2em');
        }
        STORE_Editor().Reset_editor_isChanged();
      })
      .catch(() => {});
  };

  editor.ui.registry.addIcon(
    'clear',
    '<svg viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg" width="24" height="24" focusable="false"><path d="M 11.597 2.365 C 11.209 2.371 10.899 2.691 10.905 3.078 L 10.905 7.204 C 10.223 7.485 9.734 8.157 9.734 8.934 L 9.734 9.404 L 8.094 9.404 C 6.42 9.404 5.049 10.775 5.049 12.449 L 5.049 12.917 C 5.049 16.548 4.147 19.253 4.147 19.253 C 4.043 19.566 4.17 19.91 4.453 20.079 C 4.453 20.079 6.991 21.584 11.139 21.584 C 12.729 21.584 14.126 21.353 15.344 21.088 C 15.503 21.11 15.664 21.075 15.8 20.993 C 17.512 20.584 18.678 20.122 18.678 20.122 C 19.028 19.971 19.195 19.57 19.053 19.215 C 19.053 19.215 18.167 17.029 18.167 12.917 L 18.167 12.449 C 18.167 10.775 16.796 9.404 15.122 9.404 L 13.482 9.404 L 13.482 8.934 C 13.482 8.157 12.993 7.485 12.311 7.204 L 12.311 3.078 C 12.316 2.682 11.993 2.359 11.597 2.365 Z M 11.586 8.475 C 11.601 8.475 11.616 8.475 11.631 8.475 C 11.884 8.489 12.077 8.676 12.077 8.934 L 12.077 10.106 C 12.077 10.494 12.391 10.809 12.779 10.809 L 15.122 10.809 C 16.036 10.809 16.761 11.535 16.761 12.449 L 16.761 12.683 L 6.454 12.683 L 6.454 12.449 C 6.454 11.535 7.18 10.809 8.094 10.809 L 10.437 10.809 C 10.825 10.809 11.139 10.494 11.139 10.106 L 11.139 8.934 C 11.139 8.676 11.331 8.489 11.586 8.475 Z M 6.388 14.088 L 16.824 14.088 C 16.95 16.84 17.33 18.336 17.551 19.018 C 17.234 19.14 16.89 19.283 15.901 19.539 C 15.717 18.985 15.434 17.982 15.355 16.166 C 15.349 15.625 14.759 15.294 14.294 15.57 C 14.065 15.707 13.932 15.961 13.951 16.227 C 14.028 18.001 14.304 19.105 14.525 19.826 C 13.503 20.02 12.387 20.179 11.139 20.179 C 10.433 20.179 9.848 20.1 9.259 20.027 C 9.428 19.583 9.607 19.045 9.727 18.166 C 9.802 17.63 9.269 17.214 8.768 17.417 C 8.534 17.512 8.367 17.725 8.334 17.975 C 8.211 18.883 8.029 19.443 7.894 19.759 C 7.876 19.799 7.887 19.769 7.873 19.8 C 6.562 19.503 5.957 19.235 5.639 19.068 C 5.831 18.416 6.251 16.737 6.388 14.088 Z"></path></svg>'
  );

  // 注册一个工具栏按钮名称
  editor.ui.registry.addToggleButton('clear', {
    icon: 'clear',
    tooltip: pluginName,
    onAction: function () {
      clearText();
    },
  });

  // 注册一个菜单项名称 menu/menubar
  editor.ui.registry.addMenuItem('eclear', {
    text: '清屏',
    onAction: function () {
      clearText();
    },
  });

  return {
    getMetadata: function () {
      return {
        //插件名和链接会显示在“帮助”→“插件”→“已安装的插件”中
        name: pluginName, //插件名称
        url: 'http://exampleplugindocsurl.com', //作者网址
      };
    },
  };
});
