export const quick_input_introduction =
  "<p>此工具可以实现插入法条以及格式化日期、金额等功能。基础用法为“功能代码+空格+内容” </p>" +
  "<p><strong>&#10059; 格式化日期：</strong></p>" +
  "<p><i>例如：</i>输入“<b>rq 2022.2.2</b>”后将会显示格式化后日期。输入后将会候选“2022年2月2日”“二〇二二年二月二日”<br/>" +
  "（日期支持“<b>20.2.2</b>”的简化格式,简化年份的区间为1950-2049年，非该区间请输入完整日期；<br/>日期分割符支持「. - \\ /」四种，此外还支持使用“<b>rq today</b>”快捷输入当天日期）<p/>" +
  "<p><strong>&#10059; 格式化金额：</strong></p>" +
  "<p><i>例如：</i>输入“<b>je 165.73</b>”后将会显示格式化后的选项，选择后编辑器中将会插入“人民币壹佰陆拾伍元柒角叁分”</p>" +
  "<p><strong>&#10059; 查询市、区县级地址：</strong></p>" +
  "<p>（需在设置中自行更新地址数据文件，详见设置内容；该功能可匹配“市、县区级”，不匹配“省、直辖市”）</p>" +
  "<p><i>例如：</i>输入“<b>dz 西湖</b>”后将会显示查询到包含“西湖”的地址选项，选择后编辑器中将会插入“浙江省杭州市西湖区”</p>" +
  "<p><strong>&#10059; 插入法条：</strong></p>" +
  "<p>（需在设置中引入需要检索的法条，引入方法详见设置）</p>" +
  "<i>例如：</i>输入“<b>ft 民诉法42.1.1</b>”后会显示对应法条<br/>" +
  "选择后编辑器中将会插入“《中华人民共和国民事诉讼法》第四十二条第一款第（一）项……”</p>" +
  "<p><strong>内置法律名称及其对应简称</strong></p>" +
  "<p>《中华人民共和国民法典》 &#10132 民法典<br/>" +
  "《中华人民共和国民事诉讼法》 &#10132 民诉法<br/>" +
  "《最高人民法院关于适用<中华人民共和国民事诉讼法>的解释》 &#10132 民诉法解释";